IdeaRS.Connections
RibData.SideCode Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the placement of the ribs relative to middle plane of the side plate
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PlateSideCode SideCode { get; set; }
Property Value
Type: PlateSideCode
See Also
Reference
RibData Class
IdeaRS.Connections.Data Namespace